G = {"Лиговский проспект" : ["Площадь Александра Невского 2"],
     "Площадь Александра Невского 2" : ["Площадь Александра Невского 1", "Лиговский проспект", "Новочеркасская"],
     "Площадь Александра Невского 1" : ["Площадь Александра Невского 2", "Елизаровская"],
     "Новочеркасская" : ["Площадь Александра Невского 2", "Ладожская"],
     "Ладожская" : ["Новочеркасская", "Проспект Большевиков"],
     "Проспект Большевиков" : ["Ладожская", "Дыбенко"],
     "Дыбенко" : ["Проспект Большевиков"]}