"""
Напишите функцию print_2_add_2,
которая будет складывать 2 и 2, а затем печатать этот результат.
Не забудьте вызвать функцию, чтобы увидеть результат.
"""

def print_2_add_2():
    s = 2 + 2
    print(s)

print_2_add_2()