"""Задание 19.6.4

Из списка в предыдущем задании найдите кортеж с минимальным индексом массы тела"""


data = [
   (82, 191),
   (68, 174),
   (90, 189),
   (73, 179),
   (76, 184)
]

x = sorted(data, key = lambda x: x[0] / (x[1]/100) ** 2)
y = min(data, key = lambda x: x[0] / (x[1]/100) ** 2)
print(x)
print(y)